src/docker/infrastructure.org
#+TITLE: Docker基础技术
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="css/main.css" />
#+OPTIONS: num:nil timestamp:nil

* Namespace
Linux Namespace是Linux提供的一种内核级别环境隔离的方法。很早以前的Unix有一个叫chroot的系统调用（通过修改根目录把用户jail到一个特定目录下），chroot提供了一种简单的隔离模式：chroot内部的文件系统无法访问外部的内容。Linux Namespace在此基础上，提供了对UTS、IPC、mount、PID、network、User等的隔离机制 

Linux Namespace 有如下种类：
  #+CAPTION: Linux Namespace种类
  #+ATTR_HTML: :border 1 :rules all :frame boader
| 分类               | 系统调用      | 内核版本                             |
| Mount namespaces   | CLONE_NEWNS   | Linux 2.4.19                         |
| UTS namespaces     | CLONE_NEWUTS  | Linux 2.6.19                         |
| IPC namespaces     | CLONE_NEWIPC  | Linux 2.6.19                         |
| PID namespaces     | CLONE_NEWPID  | Linux 2.6.24                         |
| Network namespaces | CLONE_NEWNET  | 始于Linux 2.6.24 完成于 Linux 2.6.29 |
| User namespaces    | CLONE_NEWUSER | 始于 Linux 2.6.23 完成于 Linux 3.8   |

** 系统调用
主要是三个系统调用：
+ clone()：实现线程的系统调用，用来创建一个新的进程，并可以通过设计上述参数达到隔离
+ unshare()：使某进程脱离某个namespace
+ setns()：把某进程加入到某个namespace

unshare() 和 setns() 都比较简单 
*** clone

* Cgroup

* Aufs

* DeviceMapper
