html/docker/infrastructure.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Docker基础技术</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Wu, Shanliang" />

<link rel="stylesheet" type="text/css" href="css/main.css" />

</head>
<body>
<div id="content">
<h1 class="title">Docker基础技术</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Namespace</a>
<ul>
<li><a href="#sec-1-1">系统调用</a>
<ul>
<li><a href="#sec-1-1-1">clone</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2">Cgroup</a></li>
<li><a href="#sec-3">Aufs</a></li>
<li><a href="#sec-4">DeviceMapper</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Namespace</h2>
<div class="outline-text-2" id="text-1">
<p>
Linux Namespace是Linux提供的一种内核级别环境隔离的方法。很早以前的Unix有一个叫chroot的系统调用（通过修改根目录把用户jail到一个特定目录下），chroot提供了一种简单的隔离模式：chroot内部的文件系统无法访问外部的内容。Linux Namespace在此基础上，提供了对UTS、IPC、mount、PID、network、User等的隔离机制 
</p>

<p>
Linux Namespace 有如下种类：
</p>
<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> Linux Namespace种类</caption>

<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">分类</td>
<td class="left">系统调用</td>
<td class="left">内核版本</td>
</tr>

<tr>
<td class="left">Mount namespaces</td>
<td class="left">CLONE<sub>NEWNS</sub></td>
<td class="left">Linux 2.4.19</td>
</tr>

<tr>
<td class="left">UTS namespaces</td>
<td class="left">CLONE<sub>NEWUTS</sub></td>
<td class="left">Linux 2.6.19</td>
</tr>

<tr>
<td class="left">IPC namespaces</td>
<td class="left">CLONE<sub>NEWIPC</sub></td>
<td class="left">Linux 2.6.19</td>
</tr>

<tr>
<td class="left">PID namespaces</td>
<td class="left">CLONE<sub>NEWPID</sub></td>
<td class="left">Linux 2.6.24</td>
</tr>

<tr>
<td class="left">Network namespaces</td>
<td class="left">CLONE<sub>NEWNET</sub></td>
<td class="left">始于Linux 2.6.24 完成于 Linux 2.6.29</td>
</tr>

<tr>
<td class="left">User namespaces</td>
<td class="left">CLONE<sub>NEWUSER</sub></td>
<td class="left">始于 Linux 2.6.23 完成于 Linux 3.8)</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">系统调用</h3>
<div class="outline-text-3" id="text-1-1">
<p>
主要是三个系统调用：
</p>
<ul class="org-ul">
<li>clone()：实现线程的系统调用，用来创建一个新的进程，并可以通过设计上述参数达到隔离
</li>
<li>unshare()：使某进程脱离某个namespace
</li>
<li>setns()：把某进程加入到某个namespace
</li>
</ul>

<p>
unshare() 和 setns() 都比较简单 
</p>
</div>
<div id="outline-container-sec-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">clone</h4>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Cgroup</h2>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Aufs</h2>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">DeviceMapper</h2>
</div>
</div>
<div id="postamble" class="status">

		  <br/>
		  <div class='ds-thread'></div>
		  <script>
		  var duoshuoQuery = {short_name:'klose911'};
		  (function() {
					  var dsThread = document.getElementsByClassName('ds-thread')[0];
					  dsThread.setAttribute('data-thread-key', document.title);
					  dsThread.setAttribute('data-title', document.title);
					  dsThread.setAttribute('data-url', window.location.href);
					  var ds = document.createElement('script');
					  ds.type = 'text/javascript';ds.async = true;
					  ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
					  ds.charset = 'UTF-8';
					  (document.getElementsByTagName('head')[0] 
						|| document.getElementsByTagName('body')[0]).appendChild(ds);
					  })();
		  </script>
		  <script>
		  (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
			(i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
			m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
			})(window,document,'script','https://www.google-analytics.com/analytics.js','ga');
		  ga('create', 'UA-90850421-1', 'auto');
		  ga('send', 'pageview');
		  </script>
</div>
</body>
</html>
